{
	"title": "Business Model",
    "title-content": "Empowering Chinese-American youth to rise and thrive in leadership and entrepreneurial roles. College is not the only path in life. However, we believe that a strong education helps build a stronger foundation for success and one of our steps in realizing this vision. At ClearPillar, we are committed to fostering academic excellence and creating pathways for future leaders and innovators.",
    "target": "Target Audience",
    "target-content": "Students and Parents seeking guidance through the complexities of college admissions, financial aid, and academic planning.",
    "services": "Services for Students and Parents",
    "services1": "Admission Strategy and College List Building: Tailored strategies for building a personalized college list and planning applications.",
    "services2": "Award Letters Comparison: Helping families compare financial aid offers to make informed decisions.",
    "services3": "Common App and Application Review: Comprehensive review of applications to ensure they are complete and aligned with each school’s standards.",
    "services4": "Essay Support: In-depth support for crafting impactful essays, including Common Application and supplemental essays.",
    "services5": "Extracurricular Planning: Support in building and highlighting extracurriculars.",
	"services6": "FAFSA and CSS Form Submission: Expert assistance with filing FAFSA and CSS Profile forms accurately.",
    "services7": "Financial Aid and Appeal Letters: Guidance in understanding financial aid packages and writing appeal letters if necessary.",
    "services8": "Resume Editing : Support in building a strong resume.",
    "services9": "SAT/ACT Tutoring: Focused tutoring services to help students improve standardized test scores.",
    "services10": "Scholarship: Assistance in identifying scholarship opportunities.",
    "services11": "Tuition Planning: Creating manageable financial plans for college tuition and expenses.",
    "core": "Core Players: Liaisons",
    "core-content": "ClearPillar functions as a comprehensive support system for students and their families, offering a wide range of services in the college admissions process. Acting as a central liaison, ClearPillar connects students and parents with specialists across key areas as such:",
    "team": "Team Expertise and Specializations:",
    "team1": "Essay and Storytelling Specialist: Expert in developing essay content that tells each student’s unique story in a way that resonates with admissions officers.",
    "team2": "Admissions Strategist: Former admissions counselor providing insights on what colleges look for in applicants.",
    "team3": "Licensed Financial Professional: Certified public accountant (CPA) and financial advisor to assist with financial planning and aid navigation.",
    "team4": "Student Advisors: Professionals dedicated to guiding students through each step of the college admissions process.",
    "team5": "SAT/ACT Tutors: Specialized tutors who focus on preparing students for college entrance exams.",
    "motto": "Motto: ",   
	"motto-content-strong": "“How do you know what you don’t know?”",
    "motto-content": "At ClearPillar, we help students uncover hidden strengths and untapped potential,",
    "motto-content2": "ensuring their applications reflect the best of who they are.",
    "button": "Join the Team!"
}