{
	"title": "Join ClearPillar as a Strategist",
    "title-content": "At ClearPillar, we’re dedicated to offering the best college advisory services, which means having a team of specialized strategists who bring expertise in specific areas rather than a one-size-fits-all approach. We believe students benefit most when they’re supported by experts who are deeply knowledgeable in distinct areas. We are currently looking for talented strategists in the following specialties:",
    "available": "Available Specialist Roles:",
    "res": "Responsibilities: ",
    "goal": "Goal: ",
    "1-title": "Scholarship Specialist",
    "1-res": "Guide students in finding and applying for scholarships.",
    "1-goal": "Ensure students have a strong, achievable college application plan while maximizing scholarship opportunities.",
    "2-title": "Admission Strategy Development Specialist",
    "2-res": "Develop tailored admission strategies that highlight each student's strengths, interests, and unique profile.",
    "2-goal": "Help students strategically position themselves for acceptance by understanding what each institution values.",
    "3-title": "Essay Assistance Specialist",
    "3-res": "Work with students on drafting, refining, and finalizing their main and supplemental essays, including Common App essays. Emphasis is on storytelling and authenticity.",
    "3-goal": "Guide students to create compelling essays that authentically represent who they are, making them stand out to admissions committees.",
    "4-title": "Financial Aid Assistance Specialist",
    "4-res": "Support families with financial aid applications, including FAFSA and CSS Profile submissions, and offer guidance on writing appeal letters to request additional aid.",
    "4-goal": "Maximize financial aid opportunities for families and alleviate the financial burden of college expenses.",
    "5-title": "Tuition Planning Specialist",
    "5-res": "Offer tailored tuition planning and budgeting strategies that align with families' long-term financial goals.",
    "5-goal": "Ensure families can manage college costs sustainably and avoid excessive debt.",
    "6-title": "Resume Editing Specialist",
    "6-res": "Assist students in creating impactful resumes that effectively highlight their achievements, skills, and extracurriculars.",
    "6-goal": "Equip students with polished resumes that enhance their applications and impress admissions committees.",
    "7-title": "SAT/ACT Preparation Specialist",
    "7-res": "Provide tutoring and resources to help students maximize their performance on standardized tests.",
    "7-goal": "Boost students’ scores to enhance their applications and increase their competitiveness.",    
    "network": "ClearPillar’s Network of Specialized Advisors",
    "network-content": "Our team of strategists includes a diverse network of experts, each with unique skills to support students’ application journeys:",
    "network1-bold": "Essay Content and Storytelling Specialists: ",
    "network1": "Experts in crafting personal stories that resonate. They help students discover and articulate compelling narratives that elevate their application essays.",
    "network2-bold": "Former Admissions Counselors: ",
    "network2": "Professionals with admissions backgrounds who offer insider insights into what colleges seek. They guide students in building applications that reflect what admissions officers value most.",
    "network3-bold": "Licensed Financial Professionals and CPAs: ",
    "network3": "Financial experts who support families with college cost planning, award letter reviews, and strategies to maximize scholarships and financial aid.",
    "network4-bold": "Student Advisors: ",
    "network4": "Current or recent college students who share real-life perspectives on college life and application tips, providing relatable guidance to applicants.",
    "network5-bold": "SAT/ACT Tutors: ",
    "network5": "Tutors specializing in standardized test preparation who are dedicated to helping students achieve their best possible scores.",
    "why": "Why Join ClearPillar as a Specialist?",
    "card1": "Focus on Your Expertise",
    "card1-flipped": "Concentrate on the area where you excel, providing a higher level of service.",
    "card2": "Collaborative Environment",
    "card2-flipped": "Work alongside a team of professionals who bring complementary skills to offer a holistic approach to each student’s journey.",
    "card3": "Impactful Contribution",
    "card3-flipped": "Support students by contributing specialized knowledge, helping them to succeed in the specific aspects of their application..",    
    "card4": "Competitive Compensation",
    "card4-flipped": "Receive fair pay for your expertise and time.",
    "how": "How It Works",
    "how1-strong": "Apply:",
    "how1-content": "Submit your application to become a liaison at ClearPillar.",
    "how2-strong": "Interview:",
    "how2-content": "Participate in an interview to discuss your skills and experience.",
    "how3-strong": "Onboarding:",
    "how3-content": "Complete the onboarding process and start facilitating client-strategist interactions.",
    "ready": "Ready to Join Our Team?",
    "ready-content": "Join us in empowering students with a comprehensive, specialized approach to college admissions!",
    "ending": "Apply today and bring your expertise to ClearPillar’s mission of delivering unparalleled support to students and families.",
    "button": "Apply to be a Specialist"
}