{
    "title": "Introducing Student Advisors on ClearPillar",
    "paragraph": "At ClearPillar, we believe in providing the most authentic and firsthand insights into colleges and universities. That's why we've introduced Student Advisors—a unique opportunity for prospective students to connect with current students from their desired schools.",
    "what": "What is a Student Advisor?",
    "answer": "A Student Advisor is a current student from a specific college or university who offers consultations about their school. These advisors provide real-time information and personal experiences to help prospective students understand what it’s really like to be a student there.",
    "learn": "What Can You Learn from a Student Advisor?",
    "learn1-strong": "School Mission and Values:",
    "learn1": " Gain insights into the school’s mission, values, and overall environment.",
    "learn2-strong": "Student Life:",
    "learn2": " Discover what daily life is like on campus, including clubs, organizations, and social activities.",
    "learn3-strong": "Application Process:",
    "learn3": " Learn how they successfully applied to the school, including tips and strategies.",
    "learn4-strong": "Academic Environment:",
    "learn4": " Understand the academic rigor, support systems, and resources available.",
    "learn5-strong": "Personal Advice:",
    "learn5": " Receive personalized advice on how to prepare and stand out in your application.",
    "how": "How It Works",
    "how1-strong": "Book a Session:",
    "how1": " Choose a Student Advisor from your desired school and book a 1-hour session.",
    "how2-strong": "Ask Questions:",
    "how2": " Prepare any questions you have about the school, student life, or the application process.",
    "how3-strong": "Get Real-Time Insights:",
    "how3": " Receive honest and detailed answers directly from a current student.",
    "how4-strong": "Session Fees:",
    "how4": " Each session costs $30, providing you with valuable, firsthand information.",
    "our": "Our Student Advisors are here to bridge the gap between prospective students and their dream schools. Whether you’re curious about the campus culture, academic expectations, or simply want to know what it’s like to live there, our Student Advisors can provide the insights you need to make informed decisions.",
    "join": "Join Our Team as a Student Advisor",
    "why": "Why Become a Student Advisor?",
    "why1-strong": "Share Your Experience:",
    "why1": " Help prospective students by sharing your firsthand experiences and insights about your school.",
    "why2-strong": "Flexible Hours:",
    "why2": " Set your own schedule and work as much or as little as you want.",
    "why3-strong": "Earn Money:",
    "why3": " Earn $30 per session by providing valuable guidance to students.",
    "why4-strong": "Build Your Resume:",
    "why4": " Gain experience in mentorship, communication, and leadership.",
    "difference": "Join our team today and make a difference in the lives of future college students!",
    "button": "Apply to be a Student Advisor"
}