{
	"title": "Join ClearPillar as a Liaison – Make a Meaningful Impact in Education",
    "title-content1": "The Liaison role at ClearPillar is vital, serving as the bridge between students, parents, and professionals. Fluent in both languages and deeply understanding of both cultures, our liaisons facilitate clear communication and understanding. They ensure students and parents—often English language learners—are fully supported and understood at every step, bridging cultural and linguistic gaps with empathy and expertise.",
    "title-content2": "At ClearPillar, our Liaisons are more than just coordinators; they are the cultural and linguistic bridge connecting students, families, and our team of admission experts. As a Liaison, you’ll play a crucial role in ensuring that students and their families receive the personalized guidance they need for college admissions success.",
    "who": "Who is a Liaison?",
    "answer": "A Liaison at ClearPillar is a caring, dedicated professional who facilitates communication, manages relationships, and oversees smooth coordination between clients and strategists. This role is essential for bridging gaps and supporting families throughout their admissions journey, especially those for whom English is a second language.",
    "why": "Why Join Us as a Liaison?",
    "card1": "Academic Strategy & College Planning",
    "card1-flipped1": "Expertise in ensuring you excel in the college admissions landscape based on your target schools.",
    "card1-flipped2": "",
    "card1-flipped3": "Direct connection with former admissions officers and advisors.",        
    "card1-flipped4": "Personalized application planning.",
    "card2": "Essay Assistance",
    "card2-flipped1": "Tailored guidance from brainstorming development and crafting your voice",
    "card2-flipped2": "Targeted support for supplemental essays tailored to specific schools.",
    "card2-flipped3": "Enhance your essays with professional editors.",  
    "card3": "Financial Aid and Tuition",
    "card3-flipped1": "Optimize your financial aid eligibility with resources provided by certified financial professionals and aid officers.",
    "card3-flipped2": "",
    "card3-flipped3": "Expert appeal process assistance is available.",
    "req": "Requirements",
    "req-step1-title": "Passion for Education",
    "req-step1": "A deep commitment to helping students and families navigate their college journeys.",
    "req-step2-title": "Student-Centric Mindset",
    "req-step2": "A genuine desire to support students and advocatehow for their success.",
    "req-step3-title": "Strong Communication Skills",
    "req-step3": "Ability to foster clear, empathetic communication between clients and strategists.",
    "req-step4-title": "Bilingual Proficiency",
    "req-step4": "Fluency in English and Chinese (Mandarin or Cantonese).",
    "res": "Liaison Responsibilities",
    "res-step1-title": "Client Matching",
    "res-step1": "Thoughtfully pair students and families with the most suitable strategists based on their profiles.",
    "res-step2-title": "Communication Facilitation",
    "res-step2": "Bridge language and cultural gaps to ensure clear, effective communication between clients and strategists.",
    "res-step3-title": "Relationship Management",
    "res-step3": "Build strong, trusting relationships with clients and strategists to enhance the admissions process.",
    "res-step4-title": "Support and Coordination",
    "res-step4": "Provide ongoing support and seamless coordination, guiding clients every step of the way.",
    "how": "How It Works",
    "how1-strong": "Apply:",
    "how1-content": "Submit your application to become a liaison at ClearPillar.",
    "how2-strong": "Interview:",
    "how2-content": "Participate in an interview to discuss your skills and experience.",
    "how3-strong": "Onboarding:",
    "how3-content": "Complete the onboarding process and start facilitating client-strategist interactions.",
    "ready": "Ready to Join Our Team?",
    "ready-content": "If you’re bilingual in English and Chinese, care deeply about education, and excel at connecting with students and families, ClearPillar needs you. Join us as a Liaison and make a real difference in students’ lives, guiding them toward college success with ClearPillar’s expert support.",
    "ending": "Apply today and be a part of a team that values cultural understanding, educational support, and student success.",
    "button": "Apply to be a Liaison"
}